# Задание 2 (тайминг 20 минут)
# 1.Написать алгоритм быстрого поиска (quicksort).

# 1.Пишем тесты для сравнения производительности сортировки больших
# массивов.
# 2.Для наглядного результата стоит сравнивать массивы до 100 000 элементов.
# При таком подходе будет явно видно, какая из сортировок окажется быстрее.

# Задание 4 (тайминг 15 минут)
# 1.После успешной сортировки массива на нем можно использовать бинарный
# поиск. Необходимо реализовать алгоритм бинарного поиска по
# элементам.
# 2.Стоит акцентировать внимание, что т.к. алгоритм использует подход
# «разделяй и властвуй», его удобно писать с помощью рекурсии.
# 3.Так что стоит акцентировать внимание на алгоритмическую сложность
# данного алгоритма, что его выполнение многократно быстрее простого
# перебора на больших массивах